{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 540, 1], "name": "input_5", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_105", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["input_5", 0, 0]]], "name": "convolution2d_105"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_107", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["input_5", 0, 0]]], "name": "convolution2d_107"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_29", "trainable": true, "dim_ordering": "th", "pool_size": [1, 1], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["input_5", 0, 0]]], "name": "maxpooling2d_29"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_104", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["input_5", 0, 0]]], "name": "convolution2d_104"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_106", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_105", 0, 0]]], "name": "convolution2d_106"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_108", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["convolution2d_107", 0, 0]]], "name": "convolution2d_108"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_109", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_29", 0, 0]]], "name": "convolution2d_109"}, {"class_name": "Merge", "config": {"name": "merge_15", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_104", 0, 0], ["convolution2d_106", 0, 0], ["convolution2d_108", 0, 0], ["convolution2d_109", 0, 0]]], "name": "merge_15"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_30", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "same"}, "inbound_nodes": [[["merge_15", 0, 0]]], "name": "maxpooling2d_30"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_111", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_30", 0, 0]]], "name": "convolution2d_111"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_113", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_30", 0, 0]]], "name": "convolution2d_113"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_31", "trainable": true, "dim_ordering": "th", "pool_size": [1, 1], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["maxpooling2d_30", 0, 0]]], "name": "maxpooling2d_31"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_110", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_30", 0, 0]]], "name": "convolution2d_110"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_112", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_111", 0, 0]]], "name": "convolution2d_112"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_114", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["convolution2d_113", 0, 0]]], "name": "convolution2d_114"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_115", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_31", 0, 0]]], "name": "convolution2d_115"}, {"class_name": "Merge", "config": {"name": "merge_16", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_110", 0, 0], ["convolution2d_112", 0, 0], ["convolution2d_114", 0, 0], ["convolution2d_115", 0, 0]]], "name": "merge_16"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_32", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "same"}, "inbound_nodes": [[["merge_16", 0, 0]]], "name": "maxpooling2d_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_117", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_32", 0, 0]]], "name": "convolution2d_117"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_119", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_32", 0, 0]]], "name": "convolution2d_119"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_33", "trainable": true, "dim_ordering": "th", "pool_size": [1, 1], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["maxpooling2d_32", 0, 0]]], "name": "maxpooling2d_33"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_116", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_32", 0, 0]]], "name": "convolution2d_116"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_118", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_117", 0, 0]]], "name": "convolution2d_118"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_120", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["convolution2d_119", 0, 0]]], "name": "convolution2d_120"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_121", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_33", 0, 0]]], "name": "convolution2d_121"}, {"class_name": "Merge", "config": {"name": "merge_17", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_116", 0, 0], ["convolution2d_118", 0, 0], ["convolution2d_120", 0, 0], ["convolution2d_121", 0, 0]]], "name": "merge_17"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_34", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "same"}, "inbound_nodes": [[["merge_17", 0, 0]]], "name": "maxpooling2d_34"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_122", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_34", 0, 0]]], "name": "convolution2d_122"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_16", "size": [2, 1]}, "inbound_nodes": [[["convolution2d_122", 0, 0]]], "name": "upsampling2d_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_123", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_16", 0, 0]]], "name": "convolution2d_123"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_17", "size": [2, 1]}, "inbound_nodes": [[["convolution2d_123", 0, 0]]], "name": "upsampling2d_17"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_124", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_17", 0, 0]]], "name": "convolution2d_124"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_18", "size": [2, 1]}, "inbound_nodes": [[["convolution2d_124", 0, 0]]], "name": "upsampling2d_18"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_125", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_18", 0, 0]]], "name": "convolution2d_125"}], "input_layers": [["input_5", 0, 0]], "output_layers": [["convolution2d_125", 0, 0]], "name": "model_5"}}